; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared2 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Phenomenon4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 169)
	(= (data Phenomenon4 infrared2) 3)
	(= (data Star5 infrared2) 241)
	(= (data Planet6 infrared2) 267)
	(= (data Planet7 infrared2) 275)
	(= (data Planet8 infrared2) 84)
	(= (data Phenomenon4 thermograph0) 286)
	(= (data Star5 thermograph0) 293)
	(= (data Planet6 thermograph0) 39)
	(= (data Planet7 thermograph0) 207)
	(= (data Planet8 thermograph0) 262)
	(= (data Phenomenon4 image1) 149)
	(= (data Star5 image1) 286)
	(= (data Planet6 image1) 278)
	(= (data Planet7 image1) 152)
	(= (data Planet8 image1) 20)
	(= (slew_time GroundStation2 GroundStation0) 12.63)
	(= (slew_time GroundStation0 GroundStation2) 12.63)
	(= (slew_time GroundStation2 GroundStation1) 51.53)
	(= (slew_time GroundStation1 GroundStation2) 51.53)
	(= (slew_time GroundStation3 GroundStation0) 52.45)
	(= (slew_time GroundStation0 GroundStation3) 52.45)
	(= (slew_time GroundStation3 GroundStation1) 41.86)
	(= (slew_time GroundStation1 GroundStation3) 41.86)
	(= (slew_time GroundStation3 GroundStation2) 4.437)
	(= (slew_time GroundStation2 GroundStation3) 4.437)
	(= (slew_time GroundStation1 GroundStation0) 20.63)
	(= (slew_time GroundStation0 GroundStation1) 20.63)
	(= (slew_time Phenomenon4 GroundStation0) 37.46)
	(= (slew_time GroundStation0 Phenomenon4) 37.46)
	(= (slew_time Phenomenon4 GroundStation1) 9.191)
	(= (slew_time GroundStation1 Phenomenon4) 9.191)
	(= (slew_time Phenomenon4 GroundStation2) 1.44)
	(= (slew_time GroundStation2 Phenomenon4) 1.44)
	(= (slew_time Phenomenon4 GroundStation3) 31.64)
	(= (slew_time GroundStation3 Phenomenon4) 31.64)
	(= (slew_time Star5 GroundStation0) 12.31)
	(= (slew_time GroundStation0 Star5) 12.31)
	(= (slew_time Star5 GroundStation1) 4.1)
	(= (slew_time GroundStation1 Star5) 4.1)
	(= (slew_time Star5 GroundStation2) 15.52)
	(= (slew_time GroundStation2 Star5) 15.52)
	(= (slew_time Star5 GroundStation3) 10.1)
	(= (slew_time GroundStation3 Star5) 10.1)
	(= (slew_time Star5 Phenomenon4) 65.59)
	(= (slew_time Phenomenon4 Star5) 65.59)
	(= (slew_time Planet6 GroundStation0) 10.74)
	(= (slew_time GroundStation0 Planet6) 10.74)
	(= (slew_time Planet6 GroundStation1) 45.33)
	(= (slew_time GroundStation1 Planet6) 45.33)
	(= (slew_time Planet6 GroundStation2) 26.72)
	(= (slew_time GroundStation2 Planet6) 26.72)
	(= (slew_time Planet6 GroundStation3) 94.18)
	(= (slew_time GroundStation3 Planet6) 94.18)
	(= (slew_time Planet6 Phenomenon4) 12.76)
	(= (slew_time Phenomenon4 Planet6) 12.76)
	(= (slew_time Planet6 Star5) 87.27)
	(= (slew_time Star5 Planet6) 87.27)
	(= (slew_time Planet7 GroundStation0) 8.922)
	(= (slew_time GroundStation0 Planet7) 8.922)
	(= (slew_time Planet7 GroundStation1) 26.11)
	(= (slew_time GroundStation1 Planet7) 26.11)
	(= (slew_time Planet7 GroundStation2) 28.55)
	(= (slew_time GroundStation2 Planet7) 28.55)
	(= (slew_time Planet7 GroundStation3) 1.758)
	(= (slew_time GroundStation3 Planet7) 1.758)
	(= (slew_time Planet7 Phenomenon4) 3.188)
	(= (slew_time Phenomenon4 Planet7) 3.188)
	(= (slew_time Planet7 Star5) 12.57)
	(= (slew_time Star5 Planet7) 12.57)
	(= (slew_time Planet7 Planet6) 14.86)
	(= (slew_time Planet6 Planet7) 14.86)
	(= (slew_time Planet8 GroundStation0) 48.63)
	(= (slew_time GroundStation0 Planet8) 48.63)
	(= (slew_time Planet8 GroundStation1) 36.62)
	(= (slew_time GroundStation1 Planet8) 36.62)
	(= (slew_time Planet8 GroundStation2) 29.48)
	(= (slew_time GroundStation2 Planet8) 29.48)
	(= (slew_time Planet8 GroundStation3) 34.92)
	(= (slew_time GroundStation3 Planet8) 34.92)
	(= (slew_time Planet8 Phenomenon4) 14.53)
	(= (slew_time Phenomenon4 Planet8) 14.53)
	(= (slew_time Planet8 Star5) 18.17)
	(= (slew_time Star5 Planet8) 18.17)
	(= (slew_time Planet8 Planet6) 68.46)
	(= (slew_time Planet6 Planet8) 68.46)
	(= (slew_time Planet8 Planet7) 70.72)
	(= (slew_time Planet7 Planet8) 70.72)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star5 thermograph0)
	(have_image Planet6 image1)
	(have_image Planet7 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation0 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 169 to 120.37, (fuel-used) from 0 to 48.63
   goals met: 0 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 3
4. (turn_to satellite0 star5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 120.37 to 108.06, (fuel-used) from 48.63 to 60.94
   goals met: 0 of 3
5. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 108.06 to 95.75, (fuel-used) from 60.94 to 73.25
   goals met: 0 of 3
6. (turn_to satellite0 planet7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 95.75 to 86.828, (fuel-used) from 73.25 to 82.172
   goals met: 0 of 3
7. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   changed: (data_capacity satellite0) from 1000 to 848, (data-stored) from 0 to 152
   goals met: 1 of 3
8. (turn_to satellite0 star5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 86.828 to 74.258, (fuel-used) from 82.172 to 94.742
   goals met: 1 of 3
9. (take_image satellite0 star5 instrument0 thermograph0)
   added: (have_image star5 thermograph0)
   changed: (data_capacity satellite0) from 848 to 555, (data-stored) from 152 to 445
   goals met: 2 of 3
10. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 74.258 to 61.948, (fuel-used) from 94.742 to 107.052
   goals met: 2 of 3
11. (turn_to satellite0 planet6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 61.948 to 51.208, (fuel-used) from 107.052 to 117.792
   goals met: 2 of 3
12. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   changed: (data_capacity satellite0) from 555 to 277, (data-stored) from 445 to 723
   goals met: 3 of 3
